[
    {
        "concepto": "Sincronización",
        "definicion": "Asegura que tareas concurrentes accedan a recursos compartidos de manera ordenada y segura."
    },
    {
        "concepto": "Condición de carrera",
        "definicion": "Error donde el resultado final depende del orden impredecible de ejecución de los procesos."
    },
    {
        "concepto": "Sección crítica",
        "definicion": "Bloque de código donde un proceso accede a recursos compartidos (variables, archivos)."
    },
    {
        "concepto": "Exclusión mutua",
        "definicion": "Técnica que garantiza que solo un proceso acceda a la sección crítica a la vez."
    },
    {
        "concepto": "Atomicidad",
        "definicion": "Propiedad que implica que una operación se ejecuta completamente o no se ejecuta en absoluto."
    },
    {
        "concepto": "Abrazo mortal (Deadlock)",
        "definicion": "Situación donde procesos quedan bloqueados esperando recursos que otros poseen."
    },
    {
        "concepto": "Semáforo",
        "definicion": "Variable entera protegida usada para coordinar el acceso a recursos limitados."
    },
    {
        "concepto": "Semáforo binario",
        "definicion": "Semáforo que solo permite valores 0 y 1, funcionando como un candado."
    },
    {
        "concepto": "Semáforo contable",
        "definicion": "Mantiene un conteo de los recursos disponibles; bloquea si llega a 0."
    },
    {
        "concepto": "Operación wait()",
        "definicion": "Solicita acceso al recurso y bloquea al proceso si no hay disponibilidad."
    },
    {
        "concepto": "Operación signal()",
        "definicion": "Libera un recurso y despierta a los procesos que están en espera."
    },
    {
        "concepto": "Mutex",
        "definicion": "Mecanismo de bloqueo exclusivo; solo el hilo que lo adquirió puede liberarlo."
    },
    {
        "concepto": "Monitores",
        "definicion": "Abstracción de alto nivel que encapsula métodos y exclusión mutua en una estructura."
    },
    {
        "concepto": "Variables de condición",
        "definicion": "Permiten suspender un proceso dentro de un monitor hasta que se cumpla un requisito."
    },
    {
        "concepto": "Productor-Consumidor",
        "definicion": "Problema clásico de coordinación resuelto eficientemente con monitores."
    },
    {
        "concepto": "Coherencia de datos",
        "definicion": "Objetivo principal de la sincronización para evitar la corrupción de información."
    },
    {
        "concepto": "Barreras",
        "definicion": "Mecanismo que coordina el avance simultáneo de múltiples hilos dependientes."
    },
    {
        "concepto": "Inanición",
        "definicion": "Riesgo donde un proceso nunca obtiene los recursos por mala gestión de prioridades."
    },
    {
        "concepto": "Recurso compartido",
        "definicion": "Elemento (memoria, dispositivo) al que intentan acceder varios procesos a la vez."
    },
    {
        "concepto": "Control de concurrencia",
        "definicion": "Conjunto de técnicas para asegurar la ejecución segura de procesos paralelos."
    }
]