[
    {
        "concepto": "Comunicación entre procesos (IPC)",
        "definicion": "Conjunto de métodos para sincronización e intercambio de datos entre procesos concurrentes."
    },
    {
        "concepto": "Tuberías (Pipes)",
        "definicion": "Canales unidireccionales que envían datos como un flujo constante entre procesos conectados."
    },
    {
        "concepto": "Colas de mensajes",
        "definicion": "Estructuras administradas por el kernel que permiten comunicación asíncrona y priorizada."
    },
    {
        "concepto": "Memoria compartida",
        "definicion": "Mecanismo más rápido de IPC donde procesos acceden directamente a una misma región física."
    },
    {
        "concepto": "Señales",
        "definicion": "Notificaciones asíncronas para indicar eventos como interrupciones o errores."
    },
    {
        "concepto": "Sockets",
        "definicion": "Canales bidireccionales basados en protocolos para comunicación local o en red."
    },
    {
        "concepto": "SIGINT",
        "definicion": "Señal utilizada para detener un proceso."
    },
    {
        "concepto": "SIGKILL",
        "definicion": "Señal utilizada para finalizar inmediatamente un proceso."
    },
    {
        "concepto": "CreateFileMapping()",
        "definicion": "Función de Windows utilizada para implementar memoria compartida."
    },
    {
        "concepto": "Paso de mensajes",
        "definicion": "Modelo donde el SO actúa como intermediario para transferencias sin compartir memoria."
    },
    {
        "concepto": "Comunicación síncrona",
        "definicion": "El emisor se detiene y espera hasta que el receptor valida la llegada del mensaje."
    },
    {
        "concepto": "Comunicación asíncrona",
        "definicion": "El emisor continúa su ejecución sin esperar una respuesta inmediata del receptor."
    },
    {
        "concepto": "Tuberías anónimas",
        "definicion": "Canales temporales creados con pipe() para procesos con relación jerárquica."
    },
    {
        "concepto": "Tuberías con nombre (FIFOs)",
        "definicion": "Canales persistentes creados con mkfifo para comunicar procesos no relacionados."
    },
    {
        "concepto": "FIFO",
        "definicion": "Orden 'First-In, First-Out' utilizado para la lectura y escritura en tuberías."
    },
    {
        "concepto": "msgget()",
        "definicion": "Función en sistemas Unix para crear o acceder a una cola de mensajes."
    },
    {
        "concepto": "Semáforos",
        "definicion": "Mecanismo de sincronización requerido en memoria compartida para evitar conflictos."
    },
    {
        "concepto": "Buffer del kernel",
        "definicion": "Espacio de memoria gestionado por el SO donde actúan las tuberías."
    },
    {
        "concepto": "TCP/IP y UDP",
        "definicion": "Protocolos base sobre los que funcionan los sockets."
    },
    {
        "concepto": "Ventaja de Memoria Compartida",
        "definicion": "Evita la intervención del kernel durante la transferencia de datos, aumentando la velocidad."
    }
]