[
    {
        "concepto": "Modelo multihilo",
        "definicion": "Capacidad de un proceso para contener múltiples flujos de ejecución concurrentes."
    },
    {
        "concepto": "Hilo (Thread)",
        "definicion": "Unidad básica de uso de CPU con su propio contador de programa, pila y registros."
    },
    {
        "concepto": "Recursos compartidos",
        "definicion": "Elementos como el código, datos globales y archivos abiertos accesibles por todos los hilos."
    },
    {
        "concepto": "Recursos privados",
        "definicion": "Elementos únicos de cada hilo, como el Stack (pila) y los registros de CPU."
    },
    {
        "concepto": "Modelo Muchos a Uno",
        "definicion": "Mapea múltiples hilos de usuario a un solo hilo del kernel; si uno se bloquea, todos lo hacen."
    },
    {
        "concepto": "Modelo Uno a Uno",
        "definicion": "Cada hilo de usuario tiene un hilo de kernel correspondiente; permite mayor concurrencia."
    },
    {
        "concepto": "Modelo Muchos a Muchos",
        "definicion": "Multiplexa hilos de usuario sobre un número igual o menor de hilos de kernel."
    },
    {
        "concepto": "Hilos de usuario (ULT)",
        "definicion": "Gestionados por bibliotecas en espacio de usuario sin intervención directa del kernel."
    },
    {
        "concepto": "Hilos de kernel (KLT)",
        "definicion": "Soportados y gestionados directamente por el sistema operativo."
    },
    {
        "concepto": "POSIX Pthreads",
        "definicion": "Estándar IEEE (1003.1c) que define una API para la creación y sincronización de hilos."
    },
    {
        "concepto": "Win32 Threads",
        "definicion": "API nativa de Windows para la gestión de hilos."
    },
    {
        "concepto": "Paralelismo",
        "definicion": "Ejecución física simultánea de hilos en diferentes núcleos o procesadores."
    },
    {
        "concepto": "Concurrencia",
        "definicion": "Manejo de múltiples tareas que progresan, aunque no necesariamente al mismo instante físico."
    },
    {
        "concepto": "Sincronización",
        "definicion": "Mecanismos (como mutex o semáforos) para coordinar el acceso a recursos compartidos."
    },
    {
        "concepto": "Condición de carrera",
        "definicion": "Error donde el resultado depende del orden impredecible de ejecución de los hilos."
    },
    {
        "concepto": "Ventaja de ULT",
        "definicion": "Creación y cambio de contexto muy rápidos al no requerir llamadas al sistema."
    },
    {
        "concepto": "Desventaja de ULT",
        "definicion": "No aprovechan el multiprocesamiento real; el kernel los ve como un solo proceso."
    },
    {
        "concepto": "Ventaja de KLT",
        "definicion": "Si un hilo se bloquea, el kernel puede programar otro hilo del mismo proceso."
    },
    {
        "concepto": "Biblioteca de hilos",
        "definicion": "API que proporciona al programador funciones para crear y gestionar hilos."
    },
    {
        "concepto": "Beneficio de economía",
        "definicion": "Crear hilos y cambiar entre ellos consume menos recursos que hacer lo mismo con procesos."
    }
]